In [2]:
import pandas as pd

In [24]:
df = pd.DataFrame({'languages': ['Python', 'C', 'C++', 'Java'], 'tough': ['no', 'yes', 'yes', 'no'], 'releaseYear': [1997, 1970, 1981, 1990]})
df.shape

(4, 3)

In [4]:
df.head()

  languages tough  releaseYear
0    Python    no         1997
1         C   yes         1970
2       C++   yes         1981
3      Java    no         1990

In [25]:
df.releaseYear.dtype

dtype('int64')

In [23]:
df.loc[4, :] = 6000
df.head()

  languages tough  releaseYear
0    Python    no       1997.0
1         C   yes       1970.0
2       C++   yes       1981.0
3      Java    no       1990.0
4      6000  6000       6000.0

In [21]:
df.releaseYear.dtype

dtype('float64')

In [15]:
df.loc[4, :] = ['m', 1, 2]

In [16]:
df

  languages tough releaseYear
0    Python    no      1997.0
1         C   yes      1970.0
2       C++   yes      1981.0
3      Java    no      1990.0
4         m     1           2

In [17]:
df.releaseYear.dtype

dtype('O')

In [30]:
a = {'languages': ['ruby'], 'tough': ['no'], 'releaseYear': [1993]}

In [31]:
b = pd.DataFrame(a)

In [32]:
pd.concat((df, b), ignore_index = True)

  languages tough  releaseYear
0    Python    no         1997
1         C   yes         1970
2       C++   yes         1981
3      Java    no         1990
4      ruby    no         1993

In [34]:
pd.concat((df, pd.Series(a)))

            languages tough  releaseYear       0
0              Python    no       1997.0     NaN
1                   C   yes       1970.0     NaN
2                 C++   yes       1981.0     NaN
3                Java    no       1990.0     NaN
languages         NaN   NaN          NaN  [ruby]
tough             NaN   NaN          NaN    [no]
releaseYear       NaN   NaN          NaN  [1993]

In [38]:
pd.concat((df, pd.Series(a, index = [0, 1, 2])), axis = 1)

  languages tough  releaseYear    0
0    Python    no         1997  NaN
1         C   yes         1970  NaN
2       C++   yes         1981  NaN
3      Java    no         1990  NaN

In [39]:
pd.Series(a, index = [0, 1, 2])

0    NaN
1    NaN
2    NaN
dtype: object

In [44]:
b = pd.Series([1,2])
pd.concat((df,b),axis=1)


c = pd.Series({0:'ruby',1:'no',})
pd.concat((df,c),axis=1)

0    ruby
1      no
dtype: object

  languages tough  releaseYear     0
0    Python    no         1997  ruby
1         C   yes         1970    no
2       C++   yes         1981   NaN
3      Java    no         1990   NaN

In [45]:

c = pd.Series({'0':'ruby','1':'no'})
pd.concat((df,c),axis=1)

  languages tough  releaseYear     0
0    Python    no       1997.0   NaN
1         C   yes       1970.0   NaN
2       C++   yes       1981.0   NaN
3      Java    no       1990.0   NaN
0       NaN   NaN          NaN  ruby
1       NaN   NaN          NaN    no

In [53]:
b = pd.Series([1,2])
pd.concat((df,b),axis=0)

  languages tough  releaseYear    0
0    Python    no       1997.0  NaN
1         C   yes       1970.0  NaN
2       C++   yes       1981.0  NaN
3      Java    no       1990.0  NaN
0       NaN   NaN          NaN  1.0
1       NaN   NaN          NaN  2.0

In [48]:
c = pd.Series({'0':'ruby','1':'no'})
pd.concat((df,c),axis=0)

  languages tough  releaseYear     0
0    Python    no       1997.0   NaN
1         C   yes       1970.0   NaN
2       C++   yes       1981.0   NaN
3      Java    no       1990.0   NaN
0       NaN   NaN          NaN  ruby
1       NaN   NaN          NaN    no

In [54]:
c = pd.Series({0:'ruby',1:'no'})
pd.concat((df,c),axis=0)

  languages tough  releaseYear     0
0    Python    no       1997.0   NaN
1         C   yes       1970.0   NaN
2       C++   yes       1981.0   NaN
3      Java    no       1990.0   NaN
0       NaN   NaN          NaN  ruby
1       NaN   NaN          NaN    no

In [62]:
e = pd.DataFrame([[1,2], [3, 4]],columns=['languages', 'tough'])

pd.concat((df,e))

  languages tough  releaseYear
0    Python    no       1997.0
1         C   yes       1970.0
2       C++   yes       1981.0
3      Java    no       1990.0
0         1     2          NaN
1         3     4          NaN

In [58]:
pd.DataFrame([1, 2])

   0
0  1
1  2

In [64]:
pd.DataFrame([[1, 2], 
              [3, 4],
              [5, 6]],columns=['hello','world'])

   hello  world
0      1      2
1      3      4
2      5      6